#ifndef LABEL
#define LABEL

/*===========================================================================================================================*/
// STRUCT
/*===========================================================================================================================*/

struct label        // структура, описывающая метку
{
    int token_num;  // номер токена метки
    int pc;         // номер инструкции, на которую ссылается метка
};

struct label_store
{
    label *store;   // массив, хранящий метки
    int     size;   // размер .store
    int capacity;   // емкость .store
};

/*===========================================================================================================================*/
// LABEL_STORE_CTOR_DTOR
/*===========================================================================================================================*/

void label_store_ctor (label_store *const link);
bool label_store_ctor (label_store *const link, const int capacity);
void label_store_dtor (label_store *const link);

/*===========================================================================================================================*/
// LABEL_STORE_PUSH
/*===========================================================================================================================*/

void label_store_push (label_store *const link, const int token_num, const int label_pc);

#endif //LABEL